In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker

In [5]:
data=pd.read_csv('../raw_data/grade_8_math_all.csv')
data.head()

   Year Jurisdiction  All students Average scale score
0  2022     National  All students                 274
1  2022      Alabama  All students                 264
2  2022       Alaska  All students                 270
3  2022      Arizona  All students                 271
4  2022     Arkansas  All students                 267

In [6]:
## data clean
data.replace('—', np.nan, inplace=True)
data.replace('‡', np.nan, inplace=True)
data['Year'] = pd.to_numeric(data['Year'], errors='coerce')
data.dropna(subset=['Year'], inplace=True)  # Drop rows where 'Year' is NaN
data['Year'] = data['Year'].astype(int)
data['Average scale score'] = pd.to_numeric(data['Average scale score'], errors='coerce')

In [7]:
# only 2000 years later
data = data[data['Year'] > 2000]
data = data[data['Jurisdiction'] != 'DoDEA']
data = data[data['Jurisdiction'] != 'Puerto Rico']
data = data[data['Jurisdiction'] != 'District of Columbia']

In [8]:
data['Year'] = data['Year'].astype(str)

In [9]:
null_exists = data['Average scale score'].isnull().sum()
null_exists

0

In [10]:
data

     Year   Jurisdiction  All students  Average scale score
0    2022       National  All students                274.0
1    2022        Alabama  All students                264.0
2    2022         Alaska  All students                270.0
3    2022        Arizona  All students                271.0
4    2022       Arkansas  All students                267.0
..    ...            ...           ...                  ...
535  2003       Virginia  All students                282.0
536  2003     Washington  All students                281.0
537  2003  West Virginia  All students                271.0
538  2003      Wisconsin  All students                284.0
539  2003        Wyoming  All students                284.0

[510 rows x 4 columns]

In [11]:
data.to_csv('../clean_data/after_clean.csv',index=False)